app/controllers/businesses_controller.rb

  def index
    @businesses = Business.select("*, NULL AS photos, NULL AS category_name").where(:active => true)
    @businesses.each { |business|
    photos = []
    list = BusinessPhoto.select(:id, :photo_url).where(:business_id => business[:id], :active => true)
    list.each { |url|
      photos.push(url.photo_url)
    }
    business[:photos] = photos
    category_name = Category.select(:title).where(:id => business[:category_id]).first
---
SELECT *, NULL AS photos, NULL AS category_name FROM "businesses" WHERE "businesses"."active" = ?  [["active", 1]]
SELECT "business_photos"."id", "business_photos"."photo_url" FROM "business_photos" WHERE "business_photos"."business_id" = ? AND "business_photos"."active" = ?  [["business_id", 1], ["active", 1]]
SELECT "categories"."title" FROM "categories" WHERE "categories"."id" = ? ORDER BY "categories"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    business = Business.select("*, NULL AS photos, NULL AS category_name").where(:id => params[:id]).first
    photos = []
    list = BusinessPhoto.select(:id, :photo_url).where(:business_id => business.id, :active => true)
    list.each { |url|
      photos.push(url.photo_url)
    }
    business.photos = photos
    category_name = Category.select(:title).where(:id => business.category_id).first
---
SELECT *, NULL AS photos, NULL AS category_name FROM "businesses" WHERE "businesses"."id" = ? ORDER BY "businesses"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "business_photos"."id", "business_photos"."photo_url" FROM "business_photos" WHERE "business_photos"."business_id" = ? AND "business_photos"."active" = ?  [["business_id", 1], ["active", 1]]
SELECT "categories"."title" FROM "categories" WHERE "categories"."id" = ? ORDER BY "categories"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def get_photos
    @photos = BusinessPhoto.where(:business_id => params[:id])
---
SELECT "business_photos".* FROM "business_photos" WHERE "business_photos"."business_id" = ? LIMIT ?  [["business_id", 1], ["LIMIT", 1]]

  def create
    @business = Business.new(business_params)

    if @business.save
---
INSERT INTO "businesses" ("name", "category_id", "information", "latitude", "longitude", "cm_certification", "ratings", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_business
      @business = Business.find(params[:id])
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]