app/controllers/business_photos_controller.rb

  def index
    @business_photos = BusinessPhoto.all
---
SELECT "business_photos".* FROM "business_photos"

  def create
    @business_photo = BusinessPhoto.new(business_photo_params)

    if @business_photo.save
---
INSERT INTO "business_photos" ("business_id", "photo_url", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["business_id", 1], ["photo_url", "http://tortaspiolines.com/img/3.jpg"], ["active", 1], ["created_at", "2020-09-25 15:01:56.447775"], ["updated_at", "2020-09-25 15:01:56.447775"]]

  def update
    if @business_photo.update(business_photo_params)
---
UPDATE "business_photos" SET "active" = ?, "updated_at" = ? WHERE "business_photos"."id" = ?  [["active", 0], ["updated_at", "2020-09-25 20:50:42.530478"], ["id", 1]]

    def set_business_photo
      @business_photo = BusinessPhoto.find(params[:id])
---
SELECT "business_photos".* FROM "business_photos" WHERE "business_photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]