app/controllers/categories_controller.rb

INSERT INTO "categories" ("title", "description", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @category = Category.new(category_params)

    if @category.save