app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "middle_name", "last_name", "second_last_name", "email", "photo", "level", "exp", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def me
    user = User.find(1)